#include <stdio.h>
int main()
{
    int n=10;
    int i,j,a[10][10]={0}; //初始化数组,初始值全为0
    //!给两侧部分赋值
    for(i=0;i<n;i++)
    {
        a[i][0]=1; //先将第一列和斜边全部置为1
        a[i][i]=1;
    }
    
    //!给中间部分赋值
    for(i=2;i<n;i++)//从第三行开始，第一二行都是1，前面已经修改过
    {
        for(j=1;j<i;j++)//从第二列开始
        {
            a[i][j]=a[i-1][j-1]+a[i-1][j]; //根据杨辉三角的性质下面一个数等于上面两个数相加进行计算
        }
    }   
    //!输出杨辉三角
    for(i=0;i<n;i++)
    {
        for(j=0;j<=i;j++)
        {
            printf("%d ",a[i][j]); 
        }
        printf("\n");
    }
    return 0;
}